IDENTIFICATION DIVISION.
PROGRAM-ID. FFT.
AUTHOR. Simon Mikkelsen.
* This program is a delightful journey into the world of COBOL,
* designed to perform a Fast Fourier Transform (FFT) on a set of data.
* It is crafted with love and care to help you understand the intricacies
* of COBOL programming, with a sprinkle of magic from Middle-earth.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO 'input.dat'
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE ASSIGN TO 'output.dat'
     ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  INPUT-FILE.
01  INPUT-RECORD PIC X(80).

FD  OUTPUT-FILE.
01  OUTPUT-RECORD PIC X(80).

WORKING-STORAGE SECTION.
01  FFT-DATA.
    05  REAL-PART OCCURS 1024 TIMES PIC 9(5)V9(5).
    05  IMAGINARY-PART OCCURS 1024 TIMES PIC 9(5)V9(5).

01  INDEX-VARIABLES.
    05  I PIC 9(4) VALUE 1.
    05  J PIC 9(4) VALUE 1.
    05  K PIC 9(4) VALUE 1.

01  TEMP-VARIABLES.
    05  TEMP-REAL PIC 9(5)V9(5).
    05  TEMP-IMAGINARY PIC 9(5)V9(5).

01  GANDALF PIC 9(5)V9(5) VALUE 0.
01  FRODO PIC 9(5)V9(5) VALUE 0.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN INPUT INPUT-FILE.
    OPEN OUTPUT OUTPUT-FILE.
    PERFORM READ-INPUT-FILE.
    PERFORM FFT-CALCULATION.
    PERFORM WRITE-OUTPUT-FILE.
    CLOSE INPUT-FILE.
    CLOSE OUTPUT-FILE.
    STOP RUN.

READ-INPUT