IDENTIFICATION DIVISION.
PROGRAM-ID. FactorialCalculator.
AUTHOR. Simon Mikkelsen.
* This program calculates the factorial of a given number.
* It is designed to help programmers understand the structure
* and syntax of a COBOL program. The program reads an integer
* from the user, calculates its factorial, and displays the result.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO 'INPUT.DAT'
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.DAT'
     ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  INPUT-FILE.
01  INPUT-RECORD PIC 9(5).

FD  OUTPUT-FILE.
01  OUTPUT-RECORD PIC 9(18).

WORKING-STORAGE SECTION.
01  WS-NUMBER PIC 9(5) VALUE 0.
01  WS-FACTORIAL PIC 9(18) VALUE 1.
01  WS-I PIC 9(5) VALUE 1.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN INPUT INPUT-FILE
    OPEN OUTPUT OUTPUT-FILE

    PERFORM READ-INPUT
    PERFORM CALCULATE-FACTORIAL
    PERFORM WRITE-OUTPUT

    CLOSE INPUT-FILE
    CLOSE OUTPUT-FILE
    STOP RUN.

READ-INPUT.
    READ INPUT-FILE INTO INPUT-RECORD
    MOVE INPUT-RECORD TO WS-NUMBER.

CALCULATE-FACTORIAL.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > WS-NUMBER
     MULTIPLY WS-FACTORIAL BY WS-I
    END-PERFORM.

WRITE-OUTPUT.
    MOVE WS-FACTORIAL TO OUTPUT-RECORD
    WRITE OUTPUT-RECORD.

