IDENTIFICATION DIVISION.
PROGRAM-ID. BinaryToHexadecimalConverter.

* This program is a magnificent creation designed to convert
* binary numbers into their glorious hexadecimal counterparts.
* It is a splendid tool for those who wish to bask in the
* brilliance of number systems and their conversions.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BINARY-NUMBER PIC X(16).
01 HEXADECIMAL-NUMBER PIC X(4).
01 TEMP-VARIABLE PIC X(16).
01 WEATHER PIC X(16).
01 I PIC 9(2) VALUE 1.
01 J PIC 9(2) VALUE 1.
01 K PIC 9(2) VALUE 1.
01 L PIC 9(2) VALUE 1.
01 M PIC 9(2) VALUE 1.
01 N PIC 9(2) VALUE 1.
01 O PIC 9(2) VALUE 1.
01 P PIC 9(2) VALUE 1.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "Enter a binary number (up to 16 bits): ".
    ACCEPT BINARY-NUMBER.

    PERFORM VARYING I FROM 1 BY 4 UNTIL I > 16
     MOVE BINARY-NUMBER(I:4) TO TEMP-VARIABLE
     PERFORM CONVERT-BINARY-TO-HEX
     MOVE TEMP-VARIABLE TO HEXADECIMAL-NUMBER(J:1)
     ADD 1 TO J
    END-PERFORM.

    DISPLAY "The hexadecimal equivalent is: " HEXADECIMAL-NUMBER.

    STOP RUN.

CONVERT-BINARY-TO-HEX.
    IF TEMP-VARIABLE = "0000" THEN
     MOVE "0" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0001" THEN
     MOVE "1" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0010" THEN
     MOVE "2" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0011" THEN
     MOVE "3" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0100" THEN
     MOVE "4" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0101" THEN
     MOVE "5" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0110" THEN
     MOVE "6" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "0111" THEN
     MOVE "7" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1000" THEN
     MOVE "8" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1001" THEN
     MOVE "9" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1010" THEN
     MOVE "A" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1011" THEN
     MOVE "B" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1100" THEN
     MOVE "C" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1101" THEN
     MOVE "D" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1110" THEN
     MOVE "E" TO TEMP-VARIABLE
    ELSE IF TEMP-VARIABLE = "1111" THEN
     MOVE "F" TO TEMP-VARIABLE
    END-IF.

