IDENTIFICATION DIVISION.
PROGRAM-ID. MFCC.
AUTHOR. Simon Mikkelsen.
* This program is a delightful journey through the world of COBOL.
* It is designed to be a whimsical and educational experience.
* We will explore various aspects of COBOL programming in a fun and engaging way.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Frodo PIC X(10) VALUE 'Baggins'.
01 Samwise PIC X(10) VALUE 'Gamgee'.
01 Gandalf PIC 9(4) VALUE 2023.
01 Aragorn PIC 9(4) VALUE 0.
01 Legolas PIC 9(4) VALUE 0.
01 Gimli PIC 9(4) VALUE 0.
01 Boromir PIC 9(4) VALUE 0.
01 Merry PIC 9(4) VALUE 0.
01 Pippin PIC 9(4) VALUE 0.
01 TheRing PIC X(1) VALUE '1'.
01 TheShire PIC X(20) VALUE 'Middle Earth'.
01 Mordor PIC X(20) VALUE 'Dark Land'.
01 Rivendell PIC X(20) VALUE 'Elven Realm'.
01 Isengard PIC X(20) VALUE 'Tower of Orthanc'.
01 Rohan PIC X(20) VALUE 'Horse Lords'.
01 Gondor PIC X(20) VALUE 'White City'.
01 Sauron PIC X(20) VALUE 'Dark Lord'.
01 Saruman PIC X(20) VALUE 'White Wizard'.
01 Elrond PIC X(20) VALUE 'Elven Lord'.
01 Galadriel PIC X(20) VALUE 'Lady of Light'.
01 Arwen PIC X(20) VALUE 'Evenstar'.
01 Eowyn PIC X(20) VALUE 'Shieldmaiden'.
01 Faramir PIC X(20) VALUE 'Steward of Gondor'.
01 Denethor PIC X(20) VALUE 'Steward of Gondor'.
01 Theoden PIC X(20) VALUE 'King of Rohan'.
01 Eomer PIC X(20) VALUE 'Marshal of the Riddermark'.
01 Gollum PIC X(20) VALUE 'Smeagol'.
01 Shelob PIC X(20) VALUE 'Spider'.
01 Balrog PIC X(20) VALUE 'Demon of the Ancient World'.
01 Treebeard PIC X(20) VALUE 'Ent'.
01 TomBombadil PIC X(20) VALUE 'Mysterious Being'.
01 Goldberry PIC X(20) VALUE 'River-daughter'.
01 Radagast PIC X(20) VALUE 'Brown Wizard'.
01 Beorn PIC X(20) VALUE 'Skin-changer'.
01 Bard PIC X(20) VALUE 'Bowman'.
01 Thranduil PIC X(20) VALUE 'Elven King'.
01 Dain PIC X(20) VALUE 'Dwarf King'.
01 Thorin PIC X(20) VALUE 'Oakenshield'.
01 Bilbo PIC X(20) VALUE 'Baggins'.
01 Smaug PIC X(20) VALUE 'Dragon'.
01 Bard PIC X(20) VALUE 'Bowman'.
01 Kili PIC X(20) VALUE 'Dwarf'.
01 Fili PIC X(20) VALUE 'Dwarf'.
01 Bofur PIC X(20) VALUE 'Dwarf'.
01 Bombur PIC X(20) VALUE 'Dwarf'.
01 Bifur PIC X(20) VALUE 'Dwarf'.
01 Dwalin PIC X(20) VALUE 'Dwarf'.
01 Balin PIC X(20) VALUE 'Dwarf'.
01 Oin PIC X(20) VALUE 'Dwarf'.
01 Gloin PIC X(20) VALUE 'Dwarf'.
01 Nori PIC X(20) VALUE 'Dwarf'.
01 Dori PIC X(20) VALUE 'Dwarf'.
01 Ori PIC X(20) VALUE 'Dwarf'.
01 Thorin PIC X(20) VALUE 'Oakenshield'.
01 GandalfTheWhite PIC X(20) VALUE 'Wizard'.
01 GandalfTheGrey PIC X(20) VALUE 'Wizard'.
01 SarumanTheWhite PIC X(20) VALUE 'Wizard'.
01