IDENTIFICATION DIVISION.
PROGRAM-ID. mfcc.
AUTHOR. Simon Mikkelsen.
* This program is a delightful journey through the world of COBOL.
* It is designed to showcase the beauty and elegance of COBOL programming.
* Along the way, we will encounter various variables and functions,
* each with its own unique charm and purpose.
* Let's embark on this adventure together and explore the wonders of COBOL!

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Frodo PIC 9(4) VALUE 2023.
01 Sam PIC X(10) VALUE "Hobbiton".
01 Gandalf PIC 9(4) VALUE 0.
01 Aragorn PIC 9(4) VALUE 0.
01 Legolas PIC 9(4) VALUE 0.
01 Gimli PIC 9(4) VALUE 0.
01 Boromir PIC 9(4) VALUE 0.
01 TheRing PIC X(1) VALUE "Y".
01 TheShire PIC X(20) VALUE "Middle Earth".
01 Mordor PIC 9(4) VALUE 0.
01 Sauron PIC 9(4) VALUE 0.
01 Gollum PIC 9(4) VALUE 0.
01 Bilbo PIC 9(4) VALUE 0.
01 Elrond PIC 9(4) VALUE 0.
01 Arwen PIC 9(4) VALUE 0.
01 Galadriel PIC 9(4) VALUE 0.
01 Saruman PIC 9(4) VALUE 0.
01 Radagast PIC 9(4) VALUE 0.
01 Eowyn PIC 9(4) VALUE 0.
01 Faramir PIC 9(4) VALUE 0.
01 Denethor PIC 9(4) VALUE 0.
01 Theoden PIC 9(4) VALUE 0.
01 Eomer PIC 9(4) VALUE 0.
01 Treebeard PIC 9(4) VALUE 0.
01 Merry PIC 9(4) VALUE 0.
01 Pippin PIC 9(4) VALUE 0.
01 Shadowfax PIC 9(4) VALUE 0.
01 Shelob PIC 9(4) VALUE 0.
01 Balrog PIC 9(4) VALUE 0.
01 Smaug PIC 9(4) VALUE 0.
01 Bard PIC 9(4) VALUE 0.
01 Thranduil PIC 9(4) VALUE 0.
01 Tauriel PIC 9(4) VALUE 0.
01 Kili PIC 9(4) VALUE 0.
01 Fili PIC 9(4) VALUE 0.
01 Thorin PIC 9(4) VALUE 0.
01 Dwalin PIC 9(4) VALUE 0.
01 Balin PIC 9(4) VALUE 0.
01 Oin PIC 9(4) VALUE 0.
01 Gloin PIC 9(4) VALUE 0.
01 Bifur PIC 9(4) VALUE 0.
01 Bofur PIC 9(4) VALUE 0.
01 Bombur PIC 9(4) VALUE 0.
01 Dori PIC 9(4) VALUE 0.
01 Nori PIC 9(4) VALUE 0.
01 Ori PIC 9(4) VALUE 0.
01 Beorn PIC 9(4) VALUE 0.
01 BardTheBowman PIC 9(4) VALUE 0.
01 MasterOfLakeTown PIC 9(4) VALUE 0.
01 Alfrid PIC 9(4) VALUE 0.
01 Azog PIC 9(4) VALUE 0.
01 Bolg PIC 9(4) VALUE 0.
01 Dain PIC 9(4) VALUE 0.
01 Thror PIC 9(4) VALUE 0.
01 Thrain PIC