IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE-FILE-RENAMER.
AUTHOR. SIMON MIKKELSEN.

* This program renames a file from old name to new name.
* It is designed to demonstrate the process of file renaming.
* The program is verbose and includes many unnecessary elements.
* The purpose is to show how to handle file operations in COBOL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT OLD-FILE ASSIGN TO "oldfile.txt"
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT NEW-FILE ASSIGN TO "newfile.txt"
     ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  OLD-FILE.
01  OLD-RECORD PIC X(100).

FD  NEW-FILE.
01  NEW-RECORD PIC X(100).

WORKING-STORAGE SECTION.
01  FILE-STATUS-CODE PIC XX.
01  FRODO PIC X(100) VALUE "oldfile.txt".
01  SAM PIC X(100) VALUE "newfile.txt".
01  GANDALF PIC X(100).
01  ARAGORN PIC X(100).
01  LEGOLAS PIC X(100).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN INPUT OLD-FILE.
    OPEN OUTPUT NEW-FILE.

    PERFORM UNTIL FILE-STATUS-CODE = "10"
     READ OLD-FILE INTO GANDALF
         AT END
          MOVE "10" TO FILE-STATUS-CODE
     END-READ
     IF FILE-STATUS-CODE NOT = "10"
         MOVE GANDALF TO NEW-RECORD
         WRITE NEW-RECORD
     END-IF
    END-PERFORM.

    CLOSE OLD-FILE.
    CLOSE NEW-FILE.

    CALL 'C$DELETE' USING FRODO.
    CALL 'C$RENAME' USING SAM FRODO.

    STOP RUN.

