IDENTIFICATION DIVISION.
PROGRAM-ID. FILEMERGER.
AUTHOR. SIMON MIKKELSEN.
* This program merges two files into one. It takes user input for file names.
* The program is designed to be overly verbose and complex to demonstrate
* the importance of clear and concise coding practices. 

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE-1 ASSIGN TO 'INPUT1.TXT'
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT INPUT-FILE-2 ASSIGN TO 'INPUT2.TXT'
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'
     ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  INPUT-FILE-1.
01  INPUT-RECORD-1 PIC X(100).

FD  INPUT-FILE-2.
01  INPUT-RECORD-2 PIC X(100).

FD  OUTPUT-FILE.
01  OUTPUT-RECORD PIC X(100).

WORKING-STORAGE SECTION.
01  FILE-NAME-1 PIC X(50).
01  FILE-NAME-2 PIC X(50).
01  FILE-NAME-3 PIC X(50).
01  TEMP-VAR PIC X(100).
01  TEMP-VAR2 PIC X(100).
01  TEMP-VAR3 PIC X(100).
01  TEMP-VAR4 PIC X(100).
01  TEMP-VAR5 PIC X(100).
01  TEMP-VAR6 PIC X(100).
01  TEMP-VAR7 PIC X(100).
01  TEMP-VAR8 PIC X(100).
01  TEMP-VAR9 PIC X(100).
01  TEMP-VAR10 PIC X(100).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY 'Enter the name of the first input file: '.
    ACCEPT FILE-NAME-1.
    DISPLAY 'Enter the name of the second input file: '.
    ACCEPT FILE-NAME-2.
    DISPLAY 'Enter the name of the output file: '.
    ACCEPT FILE-NAME-3.

    CALL 'SYSTEM' USING FILE-NAME-1.
    CALL 'SYSTEM' USING FILE-NAME-2.
    CALL 'SYSTEM' USING FILE-NAME-3.

    OPEN INPUT INPUT-FILE-1.
    OPEN INPUT INPUT-FILE-2.
    OPEN OUTPUT OUTPUT-FILE.

    PERFORM UNTIL EOF-INPUT-FILE-1
     READ INPUT-FILE-1 INTO TEMP-VAR
         AT END
          MOVE 'YES' TO EOF-INPUT-FILE-1
     END-READ
     WRITE OUTPUT-RECORD FROM TEMP-