IDENTIFICATION DIVISION.
PROGRAM-ID. FILEMERGER.
AUTHOR. SIMON MIKKELSEN.

* This program merges two files into one. It is designed to be overly complex
* and verbose, with a lot of unnecessary variables and functions. The purpose
* is to demonstrate the merging process in a very detailed and colorful manner.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE1 ASSIGN TO 'INPUT1.TXT'
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT INPUT-FILE2 ASSIGN TO 'INPUT2.TXT'
     ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'
     ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  INPUT-FILE1.
01  INPUT-RECORD1 PIC X(100).

FD  INPUT-FILE2.
01  INPUT-RECORD2 PIC X(100).

FD  OUTPUT-FILE.
01  OUTPUT-RECORD PIC X(100).

WORKING-STORAGE SECTION.
01  EOF-FLAG1 PIC X VALUE 'N'.
01  EOF-FLAG2 PIC X VALUE 'N'.
01  TEMP-RECORD PIC X(100).
01  GOLLUM PIC X(100).
01  FRODO PIC X(100).
01  SAMWISE PIC X(100).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN INPUT INPUT-FILE1
    OPEN INPUT INPUT-FILE2
    OPEN OUTPUT OUTPUT-FILE

    PERFORM UNTIL EOF-FLAG1 = 'Y' AND EOF-FLAG2 = 'Y'
     PERFORM READ-FILE1
     PERFORM READ-FILE2
     IF EOF-FLAG1 = 'N'
         MOVE INPUT-RECORD1 TO TEMP-RECORD
         MOVE TEMP-RECORD TO OUTPUT-RECORD
         WRITE OUTPUT-RECORD
     END-IF
     IF EOF-FLAG2 = 'N'
         MOVE INPUT-RECORD2 TO TEMP-RECORD
         MOVE TEMP-RECORD TO OUTPUT-RECORD
         WRITE OUTPUT-RECORD
     END-IF
    END-PERFORM

    CLOSE INPUT-FILE1
    CLOSE INPUT-FILE2
    CLOSE OUTPUT-FILE
    STOP RUN.

READ-FILE1.
    READ INPUT-FILE1 INTO GOLLUM
     AT END MOVE 'Y' TO EOF-FLAG1
     NOT AT